# Bienvenido al Notebook de Transformaciones
Acá vas a ver todas las transformaciones básicas para poner a funcionar el dataset que en un principio estaba casi inutilizable o muy difícil de acceder, lo que hago acá es disponibilizar los datos

In [1]:
import pandas as pd #Importo las librerías que voy a utilizar, solo pandas...

In [2]:
df_a_transformar = pd.read_csv('./datasets/movies_dataset.csv') #Accedo al csv entre mis archivos con la ruta relativa
df_a_transformar.head(2)

C:\Users\yesen\AppData\Local\Temp\ipykernel_16348\4105753216.py:1: DtypeWarning: Columns (10) have mixed types. Specify dtype option on import or set low_memory=False.
  df_a_transformar = pd.read_csv('./datasets/movies_dataset.csv') #Accedo al csv entre mis archivos con la ruta relativa

,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,...,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
0,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",...,1995-10-30,373554033.0,81.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Toy Story,False,7.7,5415.0
1,False,NaN,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",NaN,8844,tt0113497,en,Jumanji,When siblings Judy and Peter discover an encha...,...,1995-12-15,262797249.0,104.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Roll the dice and unleash the excitement!,Jumanji,False,6.9,2413.0

### Accedo a las columnas con diccionarios anidados
Primero quiero disponibilizar los datos que serían los más difíciles de acceder en el caso de que se mantengan como están.

In [3]:
df_btc = df_a_transformar[['belongs_to_collection', 'id']] #Comenzamos con una de las columnas que tiene los diccionarios("belngs_to_collection")
df_btc.head(5)

                               belongs_to_collection     id
0  {'id': 10194, 'name': 'Toy Story Collection', ...    862
1                                                NaN   8844
2  {'id': 119050, 'name': 'Grumpy Old Men Collect...  15602
3                                                NaN  31357
4  {'id': 96871, 'name': 'Father of the Bride Col...  11862

In [4]:
df_btc = df_btc.dropna()#Borro nulos

In [5]:
df_btc.head()

                                belongs_to_collection     id
0   {'id': 10194, 'name': 'Toy Story Collection', ...    862
2   {'id': 119050, 'name': 'Grumpy Old Men Collect...  15602
4   {'id': 96871, 'name': 'Father of the Bride Col...  11862
9   {'id': 645, 'name': 'James Bond Collection', '...    710
12  {'id': 117693, 'name': 'Balto Collection', 'po...  21032

In [14]:
indice = df_btc.shape
df_btc = df_btc.reset_index(drop=True)

for i in range(indice[0]):
    if not df_btc['id'].loc[i].isdigit():
        df_btc = df_btc.drop(i)

dict_list = df_btc['belongs_to_collection'].apply(eval).tolist() #Creo una lista con el dataframe para trabajarlo con python puro, dado que es mas sencillo para mi
id_list = df_btc['id'].apply(eval).tolist()


print(type(id_list[0:5]))
print(type(dict_list[0:5]))

<class 'list'>
<class 'list'>

In [15]:
for i in range(len(dict_list)):
    if not type(dict_list[i]) == dict: 
        dict_list.pop(i)
        id_list.pop(i)

In [18]:
print(len(dict_list))
print(len(id_list))

4491
4491

In [29]:
for_df = []
for i in range(len(dict_list)):
    diccionario = dict_list[i]
    diccionario['id_general']=id_list[i]
    for_df.append(diccionario)

df_btc = pd.DataFrame(for_df)
df_btc.head()

,id,name,poster_path,backdrop_path,id_general
0,10194,Toy Story Collection,/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg,/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg,862
1,119050,Grumpy Old Men Collection,/nLvUdqgPgm3F85NMCii9gVFUcet.jpg,/hypTnLot2z8wpFS7qwsQHW1uV8u.jpg,15602
2,96871,Father of the Bride Collection,/nts4iOmNnq7GNicycMJ9pSAn204.jpg,/7qwE57OVZmMJChBpLEbJEmzUydk.jpg,11862
3,645,James Bond Collection,/HORpg5CSkmeQlAolx3bKMrKgfi.jpg,/6VcVl48kNKvdXOZfJPdarlUGOsk.jpg,710
4,117693,Balto Collection,/w0ZgH6Lgxt2bQYnf1ss74UvYftm.jpg,/9VM5LiJV0bGb1st1KyHA3cVnO2G.jpg,21032

In [32]:
df_btc.columns=['id_franquicia', 'name_franquicia', 'poster_path', 'backdrop_path', "id"]

In [33]:
df_btc.head()#Observamos

,id_franquicia,name_franquicia,poster_path,backdrop_path,id
0,10194,Toy Story Collection,/7G9915LfUQ2lVfwMEEhDsn3kT4B.jpg,/9FBwqcd9IRruEDUrTdcaafOMKUq.jpg,862
1,119050,Grumpy Old Men Collection,/nLvUdqgPgm3F85NMCii9gVFUcet.jpg,/hypTnLot2z8wpFS7qwsQHW1uV8u.jpg,15602
2,96871,Father of the Bride Collection,/nts4iOmNnq7GNicycMJ9pSAn204.jpg,/7qwE57OVZmMJChBpLEbJEmzUydk.jpg,11862
3,645,James Bond Collection,/HORpg5CSkmeQlAolx3bKMrKgfi.jpg,/6VcVl48kNKvdXOZfJPdarlUGOsk.jpg,710
4,117693,Balto Collection,/w0ZgH6Lgxt2bQYnf1ss74UvYftm.jpg,/9VM5LiJV0bGb1st1KyHA3cVnO2G.jpg,21032

In [35]:
lista_lis = df_a_transformar[['genres', 'id']] #Seguimos con la columna "genres"
df_genres =  lista_lis

In [36]:
df_genres.head()

                                              genres     id
0  [{'id': 16, 'name': 'Animation'}, {'id': 35, '...    862
1  [{'id': 12, 'name': 'Adventure'}, {'id': 14, '...   8844
2  [{'id': 10749, 'name': 'Romance'}, {'id': 35, ...  15602
3  [{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...  31357
4                     [{'id': 35, 'name': 'Comedy'}]  11862

In [45]:
dimenciones = df_genres.shape
for_df_genres = []
lista_de_listas = []
for i in range(dimenciones[0]):

    if not df_genres['id'].loc[i].isdigit():
        df_genres=df_genres.drop(i)
    
    df_genres=df_genres.reset_index(drop = True)
    lista_de_listas = eval(df_genres['genres'].loc[i])

    for diccionario in lista_de_listas:
        dicc_mod = diccionario
        dicc_mod['id_general']=int(df_genres['id'].loc[i])

        for_df_genres.append(dicc_mod)

df_genres = pd.DataFrame(for_df_genres)
df_genres.head()

      id       name  id_general
0     16  Animation         862
1     35     Comedy         862
2  10751     Family         862
3     12  Adventure        8844
4     14    Fantasy        8844

In [46]:
df_genres.columns=['id_genre', 'genre', 'id']

In [47]:
df_genres

       id_genre      genre      id
0            16  Animation     862
1            35     Comedy     862
2         10751     Family     862
3            12  Adventure    8844
4            14    Fantasy    8844
...         ...        ...     ...
91089     10751     Family  439050
91090        18      Drama  111109
91091        28     Action   67758
91092        18      Drama   67758
91093        53   Thriller   67758

[91094 rows x 3 columns]

In [48]:
df_production_companies = df_a_transformar[['production_companies','id']]#Continuamos con la columna "production_companies"
df_production_companies

                                    production_companies      id
0         [{'name': 'Pixar Animation Studios', 'id': 3}]     862
1      [{'name': 'TriStar Pictures', 'id': 559}, {'na...    8844
2      [{'name': 'Warner Bros.', 'id': 6194}, {'name'...   15602
3      [{'name': 'Twentieth Century Fox Film Corporat...   31357
4      [{'name': 'Sandollar Productions', 'id': 5842}...   11862
...                                                  ...     ...
45461                                                 []  439050
45462             [{'name': 'Sine Olivia', 'id': 19653}]  111109
45463  [{'name': 'American World Pictures', 'id': 6165}]   67758
45464               [{'name': 'Yermoliev', 'id': 88753}]  227506
45465                                                 []  461257

[45466 rows x 2 columns]

In [49]:
df_production_companies = df_production_companies.dropna().reset_index(drop=True) #Borro los nulos y reseteo los indices para evitar errores en la iteración

In [50]:
df_production_companies

                                    production_companies      id
0         [{'name': 'Pixar Animation Studios', 'id': 3}]     862
1      [{'name': 'TriStar Pictures', 'id': 559}, {'na...    8844
2      [{'name': 'Warner Bros.', 'id': 6194}, {'name'...   15602
3      [{'name': 'Twentieth Century Fox Film Corporat...   31357
4      [{'name': 'Sandollar Productions', 'id': 5842}...   11862
...                                                  ...     ...
45458                                                 []  439050
45459             [{'name': 'Sine Olivia', 'id': 19653}]  111109
45460  [{'name': 'American World Pictures', 'id': 6165}]   67758
45461               [{'name': 'Yermoliev', 'id': 88753}]  227506
45462                                                 []  461257

[45463 rows x 2 columns]

In [55]:
mask = df_production_companies['production_companies'] == "[]"
df_production_companies = df_production_companies[~mask].reset_index(drop = True) #Borro listas vacías que no me aportan nada y vuelvo a resetear lo indices

In [57]:
df_production_companies = df_production_companies.dropna().reset_index(drop=True) #Borro los nulos y reseteo los indices para evitar errores en la iteración

In [58]:
df_production_companies

                                    production_companies      id
0         [{'name': 'Pixar Animation Studios', 'id': 3}]     862
1      [{'name': 'TriStar Pictures', 'id': 559}, {'na...    8844
2      [{'name': 'Warner Bros.', 'id': 6194}, {'name'...   15602
3      [{'name': 'Twentieth Century Fox Film Corporat...   31357
4      [{'name': 'Sandollar Productions', 'id': 5842}...   11862
...                                                  ...     ...
33583    [{'name': 'Concorde-New Horizons', 'id': 4688}]  222848
33584  [{'name': 'Westdeutscher Rundfunk (WDR)', 'id'...   30840
33585             [{'name': 'Sine Olivia', 'id': 19653}]  111109
33586  [{'name': 'American World Pictures', 'id': 6165}]   67758
33587               [{'name': 'Yermoliev', 'id': 88753}]  227506

[33588 rows x 2 columns]

In [60]:
tamaño = df_production_companies.shape
for_df_production_companies = []
for i in range(tamaño[0]):

    if df_production_companies['id'].loc[i].isdigit():
        posible_lista = eval(df_production_companies['production_companies'].loc[i])

        for diccionario in posible_lista:

            posible_dicc = diccionario
            posible_dicc['id_general'] = df_production_companies['id'].loc[i]

            for_df_production_companies.append(posible_dicc)

df_production_companies = pd.DataFrame(for_df_production_companies)
df_production_companies.head()

                        name     id id_general
0    Pixar Animation Studios      3        862
1           TriStar Pictures    559       8844
2               Teitler Film   2550       8844
3  Interscope Communications  10201       8844
4               Warner Bros.   6194      15602

In [62]:
df_production_companies.columns=['companies', 'id_companies', 'id']

In [63]:
df_production_companies

                           companies  id_companies      id
0            Pixar Animation Studios             3     862
1                   TriStar Pictures           559    8844
2                       Teitler Film          2550    8844
3          Interscope Communications         10201    8844
4                       Warner Bros.          6194   15602
...                              ...           ...     ...
70540    20th Century Fox Television         16323   30840
70541  CanWest Global Communications         38978   30840
70542                    Sine Olivia         19653  111109
70543        American World Pictures          6165   67758
70544                      Yermoliev         88753  227506

[70545 rows x 3 columns]

In [78]:
df_production_countries = df_a_transformar[['production_countries','id']]#Continuamos con la siguiente columna que se llama "production_companies"
df_production_countries

                                    production_countries      id
0      [{'iso_3166_1': 'US', 'name': 'United States o...     862
1      [{'iso_3166_1': 'US', 'name': 'United States o...    8844
2      [{'iso_3166_1': 'US', 'name': 'United States o...   15602
3      [{'iso_3166_1': 'US', 'name': 'United States o...   31357
4      [{'iso_3166_1': 'US', 'name': 'United States o...   11862
...                                                  ...     ...
45461             [{'iso_3166_1': 'IR', 'name': 'Iran'}]  439050
45462      [{'iso_3166_1': 'PH', 'name': 'Philippines'}]  111109
45463  [{'iso_3166_1': 'US', 'name': 'United States o...   67758
45464           [{'iso_3166_1': 'RU', 'name': 'Russia'}]  227506
45465   [{'iso_3166_1': 'GB', 'name': 'United Kingdom'}]  461257

[45466 rows x 2 columns]

In [79]:
df_production_countries = df_production_countries.dropna().reset_index(drop=True) #Borro nulos y reseteo indices
df_production_countries

                                    production_countries      id
0      [{'iso_3166_1': 'US', 'name': 'United States o...     862
1      [{'iso_3166_1': 'US', 'name': 'United States o...    8844
2      [{'iso_3166_1': 'US', 'name': 'United States o...   15602
3      [{'iso_3166_1': 'US', 'name': 'United States o...   31357
4      [{'iso_3166_1': 'US', 'name': 'United States o...   11862
...                                                  ...     ...
45458             [{'iso_3166_1': 'IR', 'name': 'Iran'}]  439050
45459      [{'iso_3166_1': 'PH', 'name': 'Philippines'}]  111109
45460  [{'iso_3166_1': 'US', 'name': 'United States o...   67758
45461           [{'iso_3166_1': 'RU', 'name': 'Russia'}]  227506
45462   [{'iso_3166_1': 'GB', 'name': 'United Kingdom'}]  461257

[45463 rows x 2 columns]

In [80]:
dimenciones = df_production_countries.shape
for_df_production_countries = []

for i in range(dimenciones[0]):
    if df_production_countries['id'].loc[i].isdigit():
        lista_countries = eval(df_production_countries['production_countries'].loc[i])
        
        for diccionario in lista_countries:
            p_diccionario = diccionario
            p_diccionario['id_countries'] = df_production_countries['id'].loc[i]
            for_df_production_countries.append(p_diccionario)

df_production_countries = pd.DataFrame(for_df_production_countries)

In [81]:
df_production_countries

      iso_3166_1                      name id_countries
0             US  United States of America          862
1             US  United States of America         8844
2             US  United States of America        15602
3             US  United States of America        31357
4             US  United States of America        11862
...          ...                       ...          ...
49418         IR                      Iran       439050
49419         PH               Philippines       111109
49420         US  United States of America        67758
49421         RU                    Russia       227506
49422         GB            United Kingdom       461257

[49423 rows x 3 columns]

In [82]:
df_production_countries.columns=['countries', 'full_country', 'id']

In [83]:
df_production_countries

      countries              full_country      id
0            US  United States of America     862
1            US  United States of America    8844
2            US  United States of America   15602
3            US  United States of America   31357
4            US  United States of America   11862
...         ...                       ...     ...
49418        IR                      Iran  439050
49419        PH               Philippines  111109
49420        US  United States of America   67758
49421        RU                    Russia  227506
49422        GB            United Kingdom  461257

[49423 rows x 3 columns]

In [84]:
df_s_l = df_a_transformar[['spoken_languages','id']]#la ultima columna con listas y diccionarios anidados "spoken_languages"
df_s_l

                                        spoken_languages      id
0               [{'iso_639_1': 'en', 'name': 'English'}]     862
1      [{'iso_639_1': 'en', 'name': 'English'}, {'iso...    8844
2               [{'iso_639_1': 'en', 'name': 'English'}]   15602
3               [{'iso_639_1': 'en', 'name': 'English'}]   31357
4               [{'iso_639_1': 'en', 'name': 'English'}]   11862
...                                                  ...     ...
45461             [{'iso_639_1': 'fa', 'name': 'فارسی'}]  439050
45462                  [{'iso_639_1': 'tl', 'name': ''}]  111109
45463           [{'iso_639_1': 'en', 'name': 'English'}]   67758
45464                                                 []  227506
45465           [{'iso_639_1': 'en', 'name': 'English'}]  461257

[45466 rows x 2 columns]

In [85]:
df_s_l = df_s_l.dropna().reset_index(drop=True) #Borro nulos y reseteo inidices
df_s_l

                                        spoken_languages      id
0               [{'iso_639_1': 'en', 'name': 'English'}]     862
1      [{'iso_639_1': 'en', 'name': 'English'}, {'iso...    8844
2               [{'iso_639_1': 'en', 'name': 'English'}]   15602
3               [{'iso_639_1': 'en', 'name': 'English'}]   31357
4               [{'iso_639_1': 'en', 'name': 'English'}]   11862
...                                                  ...     ...
45455             [{'iso_639_1': 'fa', 'name': 'فارسی'}]  439050
45456                  [{'iso_639_1': 'tl', 'name': ''}]  111109
45457           [{'iso_639_1': 'en', 'name': 'English'}]   67758
45458                                                 []  227506
45459           [{'iso_639_1': 'en', 'name': 'English'}]  461257

[45460 rows x 2 columns]

In [86]:
dimenciones = df_s_l.shape
for_df_s_l = []

for i in range(dimenciones[0]):
    if df_s_l['id'].loc[i].isdigit():
        lista_s_l = eval(df_s_l['spoken_languages'].loc[i])

        for diccionario in lista_s_l:
            p_diccionario = diccionario
            p_diccionario['id_general'] = df_s_l['id'].loc[i]
            for_df_s_l.append(p_diccionario)

df_s_l = pd.DataFrame(for_df_s_l)

In [87]:
df_s_l

      iso_639_1      name id_general
0            en   English        862
1            en   English       8844
2            fr  Français       8844
3            en   English      15602
4            en   English      31357
...         ...       ...        ...
53295        en   English      30840
53296        fa     فارسی     439050
53297        tl               111109
53298        en   English      67758
53299        en   English     461257

[53300 rows x 3 columns]

In [88]:
df_s_l.columns=['spooken_language','full_language','id']

In [89]:
df_s_l

      spooken_language full_language      id
0                   en       English     862
1                   en       English    8844
2                   fr      Français    8844
3                   en       English   15602
4                   en       English   31357
...                ...           ...     ...
53295               en       English   30840
53296               fa         فارسی  439050
53297               tl                111109
53298               en       English   67758
53299               en       English  461257

[53300 rows x 3 columns]

In [90]:
df_a_transformar.head(2)

,adult,belongs_to_collection,budget,genres,homepage,id,imdb_id,original_language,original_title,overview,...,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
0,False,"{'id': 10194, 'name': 'Toy Story Collection', ...",30000000,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",http://toystory.disney.com/toy-story,862,tt0114709,en,Toy Story,"Led by Woody, Andy's toys live happily in his ...",...,1995-10-30,373554033.0,81.0,"[{'iso_639_1': 'en', 'name': 'English'}]",Released,NaN,Toy Story,False,7.7,5415.0
1,False,NaN,65000000,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",NaN,8844,tt0113497,en,Jumanji,When siblings Judy and Peter discover an encha...,...,1995-12-15,262797249.0,104.0,"[{'iso_639_1': 'en', 'name': 'English'}, {'iso...",Released,Roll the dice and unleash the excitement!,Jumanji,False,6.9,2413.0

In [ ]:
dimenciones = df_a_transformar.shape
for i in range(dimenciones[0]):
    if not df_a_transformar['id'].loc[i].isdigit():
        df_a_transformar = df_a_transformar.drop(i, axis=0)

df_a_transformar = df_a_transformar.reset_index(drop=True)
df_a_transformar['id'] = df_a_transformar['id'].astype(int)

In [101]:
print(f"{df_genres.shape} | {df_s_l.shape}")

(91094, 3) | (53300, 3)

In [106]:
df_a_transformar['id'] = df_a_transformar['id'].astype(str)
df_btc['id'] = df_btc['id'].astype(str)
df_production_companies['id'] = df_production_companies['id'].astype(str)
df_production_countries['id'] = df_production_countries['id'].astype(str)
df_genres['id'] = df_genres['id'].astype(str)

In [114]:
df_completo = df_a_transformar.merge(df_btc, on='id', how='left') \
                                .merge(df_production_companies, on='id', how='right') \
                                .merge(df_production_countries, on='id', how='left') \
                                .merge(df_genres, on='id', how='right')\
                                .merge(df_s_l, on='id', how='left')

In [116]:
columnas_a_eliminar = ["video", "imdb_id", "adult", "original_title", "poster_path_y", "homepage", 'belongs_to_collection', 'genres', 'production_companies', 'production_countries', 'spoken_languages', 'poster_path_x', 'backdrop_path']
df_completo = df_completo.drop(columnas_a_eliminar, axis=1)

In [117]:
df_completo.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 448060 entries, 0 to 448059
Data columns (total 23 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   budget             426789 non-null  object
 1   id                 448060 non-null  object
 2   original_language  426705 non-null  object
 3   overview           425232 non-null  object
 4   popularity         426789 non-null  object
 5   release_date       426716 non-null  object
 6   revenue            426789 non-null  float64
 7   runtime            426494 non-null  float64
 8   status             426787 non-null  object
 9   tagline            225894 non-null  object
 10  title              426789 non-null  object
 11  vote_average       426789 non-null  float64
 12  vote_count         426789 non-null  float64
 13  id_franquicia      55070 non-null   float64
 14  name_franquicia    55070 non-null   object
 15  companies          426789 non-null  object
 16  id_companies       426789 non-null  float64
 17  countries          425219 non-null  object
 18  full_country       425219 non-null  object
 19  id_genre           448060 non-null  int64
 20  genre              448060 non-null  object
 21  spooken_language   442641 non-null  object
 22  full_language      442641 non-null  object
dtypes: float64(6), int64(1), object(16)
memory usage: 82.0+ MB

In [56]:
df_a_transformar2 = pd.read_csv('./datasets/credits.csv')

In [57]:
df_a_transformar2

,cast,crew,id
0,"[{'cast_id': 14, 'character': 'Woody (voice)',...","[{'credit_id': '52fe4284c3a36847f8024f49', 'de...",862
1,"[{'cast_id': 1, 'character': 'Alan Parrish', '...","[{'credit_id': '52fe44bfc3a36847f80a7cd1', 'de...",8844
2,"[{'cast_id': 2, 'character': 'Max Goldman', 'c...","[{'credit_id': '52fe466a9251416c75077a89', 'de...",15602
3,"[{'cast_id': 1, 'character': ""Savannah 'Vannah...","[{'credit_id': '52fe44779251416c91011acb', 'de...",31357
4,"[{'cast_id': 1, 'character': 'George Banks', '...","[{'credit_id': '52fe44959251416c75039ed7', 'de...",11862
...,...,...,...
45471,"[{'cast_id': 0, 'character': '', 'credit_id': ...","[{'credit_id': '5894a97d925141426c00818c', 'de...",439050
45472,"[{'cast_id': 1002, 'character': 'Sister Angela...","[{'credit_id': '52fe4af1c3a36847f81e9b15', 'de...",111109
45473,"[{'cast_id': 6, 'character': 'Emily Shaw', 'cr...","[{'credit_id': '52fe4776c3a368484e0c8387', 'de...",67758
45474,"[{'cast_id': 2, 'character': '', 'credit_id': ...","[{'credit_id': '533bccebc3a36844cf0011a7', 'de...",227506
45475,[],"[{'credit_id': '593e676c92514105b702e68e', 'de...",461257

In [58]:
cantidad = df_a_transformar2.shape
lista_dicc = []
lista_id = []
for i in range(cantidad[0]-1):
    s = eval(str(df_a_transformar2['cast'].loc[i]))
    
    if type(s) == list:
        for diccionario in s:
            lista_dicc.append(diccionario)
            lista_id.append(df_a_transformar2['id'].loc[i])
    else: 
        i=cantidad[0]
        print(type(s))

In [59]:
df_cast = pd.DataFrame({'cast': lista_dicc, 'id': lista_id})
df_cast

                                                     cast      id
0       {'cast_id': 14, 'character': 'Woody (voice)', ...     862
1       {'cast_id': 15, 'character': 'Buzz Lightyear (...     862
2       {'cast_id': 16, 'character': 'Mr. Potato Head ...     862
3       {'cast_id': 17, 'character': 'Slinky Dog (voic...     862
4       {'cast_id': 18, 'character': 'Rex (voice)', 'c...     862
...                                                   ...     ...
562469  {'cast_id': 2, 'character': '', 'credit_id': '...  227506
562470  {'cast_id': 3, 'character': '', 'credit_id': '...  227506
562471  {'cast_id': 4, 'character': '', 'credit_id': '...  227506
562472  {'cast_id': 5, 'character': '', 'credit_id': '...  227506
562473  {'cast_id': 6, 'character': '', 'credit_id': '...  227506

[562474 rows x 2 columns]

In [60]:
lista_dicc_crew = []
lista_id_crew = []

for i in range(cantidad[0]-1):
    s = eval(str(df_a_transformar2['crew'].loc[i]))
    
    if type(s) == list:
        for diccionario in s:
            lista_dicc_crew.append(diccionario)
            lista_id_crew.append(df_a_transformar2['id'].loc[i])
    else: 
        i=cantidad[0]
        print(type(s))

In [61]:
df_crew = pd.DataFrame({'crew': lista_dicc_crew, 'id': lista_id_crew})

In [62]:
df_crew

                                                     crew      id
0       {'credit_id': '52fe4284c3a36847f8024f49', 'dep...     862
1       {'credit_id': '52fe4284c3a36847f8024f4f', 'dep...     862
2       {'credit_id': '52fe4284c3a36847f8024f55', 'dep...     862
3       {'credit_id': '52fe4284c3a36847f8024f5b', 'dep...     862
4       {'credit_id': '52fe4284c3a36847f8024f61', 'dep...     862
...                                                   ...     ...
464308  {'credit_id': '52fe4776c3a368484e0c8393', 'dep...   67758
464309  {'credit_id': '52fe4776c3a368484e0c8399', 'dep...   67758
464310  {'credit_id': '52fe4776c3a368484e0c839f', 'dep...   67758
464311  {'credit_id': '533bccebc3a36844cf0011a7', 'dep...  227506
464312  {'credit_id': '58ebbc26925141281908aa0a', 'dep...  227506

[464313 rows x 2 columns]

In [63]:
df_credits = pd.merge(df_cast, df_crew, how='left', on='id')
df_credits

,cast,id,crew
0,"{'cast_id': 14, 'character': 'Woody (voice)', ...",862,"{'credit_id': '52fe4284c3a36847f8024f49', 'dep..."
1,"{'cast_id': 14, 'character': 'Woody (voice)', ...",862,"{'credit_id': '52fe4284c3a36847f8024f4f', 'dep..."
2,"{'cast_id': 14, 'character': 'Woody (voice)', ...",862,"{'credit_id': '52fe4284c3a36847f8024f55', 'dep..."
3,"{'cast_id': 14, 'character': 'Woody (voice)', ...",862,"{'credit_id': '52fe4284c3a36847f8024f5b', 'dep..."
4,"{'cast_id': 14, 'character': 'Woody (voice)', ...",862,"{'credit_id': '52fe4284c3a36847f8024f61', 'dep..."
...,...,...,...
9489828,"{'cast_id': 4, 'character': '', 'credit_id': '...",227506,"{'credit_id': '58ebbc26925141281908aa0a', 'dep..."
9489829,"{'cast_id': 5, 'character': '', 'credit_id': '...",227506,"{'credit_id': '533bccebc3a36844cf0011a7', 'dep..."
9489830,"{'cast_id': 5, 'character': '', 'credit_id': '...",227506,"{'credit_id': '58ebbc26925141281908aa0a', 'dep..."
9489831,"{'cast_id': 6, 'character': '', 'credit_id': '...",227506,"{'credit_id': '533bccebc3a36844cf0011a7', 'dep..."
9489832,"{'cast_id': 6, 'character': '', 'credit_id': '...",227506,"{'credit_id': '58ebbc26925141281908aa0a', 'dep..."

In [64]:
df_prueba.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 45466 entries, 0 to 45465
Data columns (total 30 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   level_0                45466 non-null  int64
 1   index                  45466 non-null  int64
 2   adult                  45466 non-null  object
 3   belongs_to_collection  4494 non-null   object
 4   budget                 45466 non-null  object
 5   genres                 45466 non-null  object
 6   homepage               7782 non-null   object
 7   id                     45466 non-null  object
 8   imdb_id                45449 non-null  object
 9   original_language      45455 non-null  object
 10  original_title         45466 non-null  object
 11  overview               44512 non-null  object
 12  popularity             45461 non-null  object
 13  poster_path_x          45080 non-null  object
 14  production_companies   45463 non-null  object
 15  production_countries   45463 non-null  object
 16  release_date           45379 non-null  object
 17  revenue                45460 non-null  float64
 18  runtime                45203 non-null  float64
 19  spoken_languages       45460 non-null  object
 20  status                 45379 non-null  object
 21  tagline                20412 non-null  object
 22  title                  45460 non-null  object
 23  video                  45460 non-null  object
 24  vote_average           45460 non-null  float64
 25  vote_count             45460 non-null  float64
 26  id_franquicia          4488 non-null   float64
 27  name_franquicia        4488 non-null   object
 28  poster_path_y          3945 non-null   object
 29  backdrop_path          3260 non-null   object
dtypes: float64(5), int64(2), object(23)
memory usage: 10.8+ MB

In [65]:
lista_index = []
for i in range(45466-1):
    if not df_prueba['id'].loc[i].isdigit():
        lista_index.append(i)

df_prueba = df_prueba.drop(lista_index)
df_prueba['id']=df_prueba['id'].astype(int)

In [66]:
df_completo = pd.merge(df_credits, df_prueba, how='left', on='id')

In [67]:
df_completo.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9505661 entries, 0 to 9505660
Data columns (total 32 columns):
 #   Column                 Dtype
---  ------                 -----
 0   cast                   object
 1   id                     int64
 2   crew                   object
 3   level_0                int64
 4   index                  int64
 5   adult                  object
 6   belongs_to_collection  object
 7   budget                 object
 8   genres                 object
 9   homepage               object
 10  imdb_id                object
 11  original_language      object
 12  original_title         object
 13  overview               object
 14  popularity             object
 15  poster_path_x          object
 16  production_companies   object
 17  production_countries   object
 18  release_date           object
 19  revenue                float64
 20  runtime                float64
 21  spoken_languages       object
 22  status                 object
 23  tagline                object
 24  title                  object
 25  video                  object
 26  vote_average           float64
 27  vote_count             float64
 28  id_franquicia          float64
 29  name_franquicia        object
 30  poster_path_y          object
 31  backdrop_path          object
dtypes: float64(5), int64(3), object(24)
memory usage: 2.3+ GB

In [ ]:
df_completo = df_completo.drop(columns=['video', 'imdb_id', 'adult', 'original_title', 'poster_path_x', 'poster_path_y', 'homepage'])

In [70]:
df_completo.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9505661 entries, 0 to 9505660
Data columns (total 25 columns):
 #   Column                 Dtype
---  ------                 -----
 0   cast                   object
 1   id                     int64
 2   crew                   object
 3   level_0                int64
 4   index                  int64
 5   belongs_to_collection  object
 6   budget                 object
 7   genres                 object
 8   original_language      object
 9   overview               object
 10  popularity             object
 11  production_companies   object
 12  production_countries   object
 13  release_date           object
 14  revenue                float64
 15  runtime                float64
 16  spoken_languages       object
 17  status                 object
 18  tagline                object
 19  title                  object
 20  vote_average           float64
 21  vote_count             float64
 22  id_franquicia          float64
 23  name_franquicia        object
 24  backdrop_path          object
dtypes: float64(5), int64(3), object(17)
memory usage: 1.8+ GB

In [71]:
df_completo.isnull().sum()

cast                           0
id                             0
crew                        1806
level_0                        0
index                          0
belongs_to_collection    7417917
budget                         0
genres                         0
original_language             93
overview                   41318
popularity                   375
production_companies         375
production_countries         375
release_date                 648
revenue                      375
runtime                     8803
spoken_languages             375
status                      1434
tagline                  2233207
title                        375
vote_average                 375
vote_count                   375
id_franquicia            7418786
name_franquicia          7418786
backdrop_path            7652481
dtype: int64

In [121]:
df_completo[['revenue', 'budget']] = df_completo[['revenue', 'budget']].fillna(0)

In [125]:
df_completo['release_date'].isnull().sum()

648

In [126]:
mask = df_completo['release_date'].isnull()

In [127]:
df_completo = df_completo.drop(df_completo[mask].index)

In [128]:
df_completo['release_date'].isnull().sum()

0

In [141]:
df_completo['release_date'] = df_completo['release_date'].str.strip()
df_completo['release_date'] = pd.to_datetime(df_completo['release_date'], errors='coerce')
df_completo['release_date'] = df_completo['release_date'].dt.strftime('%Y-%m-%d')
df_completo['release_date'] = pd.to_datetime(df_completo['release_date'], errors='coerce')

In [142]:
df_completo['release_date'].dtypes

dtype('<M8[ns]')

In [143]:
df_completo['release_date']

0         1995-10-30
1         1995-10-30
2         1995-10-30
3         1995-10-30
4         1995-10-30
             ...
9505656   1917-10-21
9505657   1917-10-21
9505658   1917-10-21
9505659   1917-10-21
9505660   1917-10-21
Name: release_date, Length: 9505013, dtype: datetime64[ns]

In [150]:
df_completo['budget']=df_completo['budget'].astype(int)

In [157]:
cantidad = df_completo.shape
lista_return = []
for i in range(cantidad[0]-1):
    if (
        df_completo['budget'].loc[i] == 0 or
        df_completo['budget'].loc[i] == None
    ):
        r=0
    else:
        r = df_completo['revenue'].loc[i] / df_completo['budget'].loc[i]
    lista_return.append(r)

df_completo['return'] = lista_return

KeyError: 279072

In [145]:
type(df_completo)

pandas.core.frame.DataFrame